% Forsub 举例 解1： 0 -1  2 1 解2： 1  2  -2  -7 
n=4;b=[0 -1 0 -1];a=[1 0 0 0;-3 1 0 0;-2 2 1 0;3 0 -1 1];
x=Forsub(n,a,b)
n=4;b=[1 -1 0 2];a=[1 0 0 0;-3 1 0 0;-2 2 1 0;3 2 -1 1];
x1=Forsub(n,a,b) 

% Backsub 举例 解： -1    -2     2     1
n=4;b=[2 0 -1 1];a=[1 -1 2 -3;0 1 2 -2;0 0 1 -3;0 0 0 1];
x2=Backsub(n,a,b)

% ForsubPLT 举例 解： 1     2    -2    -7
n=4;b=[-1 1 2 0];a=[-3 1 0 0;1 0 0 0;3 2 -1 1;-2 2 1 0];
p=[2 1 4 3];
x1=ForsubPLT(n,a,b,p)

%BacksubPLT 举例 解：-1 -2 2 1
n=4;b=[-1 1 2 0];a=[0 0 1 -3;0 0 0 1;1 -1 2 -3;0 1 2 -2];
p=[3 4 1 2];
x1=BacksubPLT(n,a,b,p)

% Doolittle 举例 解见课本
n=3;a=[60 30 20;30 20 15;20 15 12];
[l,u]=Doolittle(n,a)

% Cholesky 举例 解见课本
n=3;a=[60 30 20;30 20 15;20 15 12];
l=Cholesky(n,a)

% Crout 举例 解见课本
n=3;a=[60 30 20;30 20 15;20 15 12];
[l,u]=Crout(n,a)

%LU 举例
n=3;a=[60 30 20;30 20 15;20 15 12];
[l,u]=LU(n,a)
n=3;a=[60 30 20;35 25 15;10 35 12];
[l,u]=LU(n,a)